motivation/responsiveness/latency-sensitive/cycle/period-10ms/multi.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 147.46.240.226 (be patient)


Server Software:        Apache-Coyote/1.1
Server Hostname:        147.46.240.226
Server Port:            8080

Document Path:          /examples/servlets/nonblocking/numberwriter
Document Length:        210000 bytes

Concurrency Level:      100
Time taken for tests:   6.366 seconds
Complete requests:      500
Failed requests:        1
   (Connect: 0, Receive: 0, Length: 1, Exceptions: 0)
Total transferred:      105079192 bytes
HTML transferred:       105008192 bytes
Requests per second:    78.54 [#/sec] (mean)
Time per request:       1273.169 [ms] (mean)
Time per request:       12.732 [ms] (mean, across all concurrent requests)
Transfer rate:          16119.84 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.7      0       3
Processing:   275 1176 502.7   1116    2967
Waiting:        1  527 376.0    469    1674
Total:        275 1177 502.9   1116    2969
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%   1116
  66%   1296
  75%   1459
  80%   1558
  90%   1883
  95%   2095
  98%   2355
  99%   2798
 100%   2969 (longest request)