motivation/responsiveness/latency-sensitive/cycle/period-10ms/single.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 147.46.240.226 (be patient)


Server Software:        Apache-Coyote/1.1
Server Hostname:        147.46.240.226
Server Port:            8080

Document Path:          /examples/servlets/nonblocking/numberwriter
Document Length:        210000 bytes

Concurrency Level:      1
Time taken for tests:   13.237 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      42028400 bytes
HTML transferred:       42000000 bytes
Requests per second:    15.11 [#/sec] (mean)
Time per request:       66.185 [ms] (mean)
Time per request:       66.185 [ms] (mean, across all concurrent requests)
Transfer rate:          3100.65 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    16   66 205.0     29    1900
Waiting:        1   18 119.8      1    1296
Total:         16   66 205.0     30    1900

Percentage of the requests served within a certain time (ms)
  50%     30
  66%     49
  75%     55
  80%     59
  90%     68
  95%     78
  98%    850
  99%   1756
 100%   1900 (longest request)